{
    "title": "Stickers",
    "date": "20230102",
    "sections": [
        {
            "header": "Story Time",
            "content": "<p>I have a bunch of stickers on my laptop. I've never had stickers on my laptop; I've always been the type of person to have a perfectly clean laptop or computer case. When I built my PC <hovertext>a while back#something I don't think I will do for another while, given the prices of parts</hovertext> I think the only thing I put on it was the brand badge for the graphics card. I put the badge for the processor on my water bottle, which did have a lot of stickers on it.</p><p>I think I want to start a sticker journal. I have three journals, including this blog. One is a series of letters that I send with a friend. The other is an everything journal. I used to also have a 'learning' journal where I would put my language learning, math learning stuff, and notes from my <hovertext>networking class#still need to get that CCNA</hovertext>. This learning journal was a habit from college when I had a single notebook for all of my classes. Now all that stuff gets put in my everything journal. I like the everything journal because I can keep it in my bag, and not need to want to keep an extra book in case I want to take notes on my Duolingo while I ride the bus or <hovertext>eat my lunch.#Someday I will be the type of person who can eat their lunch without doing another thing at the same time. I'm writing this while I eat breakfast even.</hovertext> I also keep another journal when I play a tabletop roleplaying game, whether I am GMing or playing a character. I really like writing things down.</p><p>But okay, should I start a sticker journal? My laptop only has so much room, I'd like them to go somewhere. I don't mind the <hovertext>impermanence#I can't spell</hovertext> of putting them on something disposable. And, I think it would be reasonable to get a sticker, bring it home in the pocket of my everything journal, and then put it into my hypothetical sticker journal. But then, I have another thing. The more things I have, the further I am from accomplishing one of my goals: have exactly one thing, so that I can say the line from Megamind: 'I'll just take my thing and go' and be honest about it.</p>",
            "startshidden": false
        },
        {
            "header": "Here is a CALL TO ACTION",
            "content": "<p>Feels a little silly since if you're reading this you probably know me personally and could text me or snap me, but let me know if I should start a sticker journal or if the stickers should go on another thing, or if they go in the everything journal, or something else? I need aNswers.</p>",
            "startshidden": true
        }
    ]
}