{
  "title": "Hot Drinks",
  "date": "20230110",
  "sections": [
    {
      "header": "Being Sick",
      "content": "<p>I've been sick for the past couple days. Starting on Sunday, I has a tiny soar throat, which I didn't think much about. Just a little soar throat, it happens. But I was pretty tired. I slept 11 hours the two nights leading up to Sunday. Then come Monday, I slept 12 hours. I woke up feeling horrible, my head hurt and my sinuses were inflamed, my throat was still soar but was now swollen. My ears wouldn't pop. I'm also fairly bad at regulating my temperature as it is, so it gets worse when I'm sick.</p><p>Last night, I was in bed for 13 hours, and probably slept for 12 of those. My throat still hurts, but my headache is under control with ibuprofen. I am finally awake, and I felt like complaining about it to the void.</p>",
      "startshidden": false
    },
    {
      "header": "Winter Sucks",
      "content": "<p>I think this season is especially hard for me. Making sure I see everyone and fighting the guilt of not seeing some people, the sunlight hours that are less than the length of the workday, cars getting stuck and roads being frozen, everyone getting sick. It feels like I am filled with obligations that I didn't ask for, and I don't get to tend to my own needs.</p><p>The song Sick and Sad by Catch 22, or Toh Kay, or <hovertext>Streetlight Manifesto#I love Toh Kay and all his projects</hovertext> - starts with \"Sick and sad again, sometimes I'd like the rain to end, sick and sad again, sometimes I'd like, hard to stand on my own two feet.\" Proceeding to sing about human struggles, and some of the hardest feelings we face. In my opinion I guess. But sometimes I listen to this song and I feel seen in a horrible way.</p><p>I am doing much better than I used to, being on e has helped me immensely. I feel more myself. And now, I can stand on my own two feet. Though, I think it is because I have a large support circle of caring physicians, mental health providers, friends that care about me and I mutually care for them, family that I can talk to. I have a very large family. I don't think I talk to them enough sometimes. I also have a lot of things I do to help myself. I make hot drinks. I love hot drinks.</p>",
      "startshidden": false
    },
    {
      "header": "Coffee",
      "content": "<p>Coffee is my most recent obsession. For channukah my dad gifted me one of those lever espresso makers. I've been enjoying that quite a lot. Though, it's definitely one of the more involved drinks I make. It takes maybe 10 or 15 minutes to make a shot of espresso, and a lot of it is hands on or waiting for the exact right timing so as to not mess up the shot and get something lemon sour. But, its very rewarding and hella fun. I definitely want to have people over so that I can show off my espresso making skills. Hosting people also makes me very happy.</p><p>I was into coffee before that though. I used to make pour overs using a cheap plastic reusable filter thing, a bit like a chemex, and pre-ground grocery store coffee. Honestly, it wasn't terrible. As a hot beverage, and a caffeine delivery mechanism, it did the job well. My pourovers now involve either a metal filter or a paper filter, depending on how much body I want in my coffee that morning, I have fancy caraffes, I weigh the coffee with a scale, I use the metric system! Goodness sometimes I use my phin or my french press. I also bought a WDT tool from daddy bezos, and I have a little water spritser so that the coffee I grind doesn't hold so much <hovertext>static#That reduces retention and clumping</hovertext>.</p><p>Sometimes I feel like I should go back and try that simple coffee making scheme, just to see if I even still like it or if I am too far gone.</p>",
      "startshidden": false
    },
    {
      "header": "Tea",
      "content": "<p>Tea is what I've been drinking the past few days. It goes down easier when it hurts to swallow, and tea bags are easier to make. Don't get me wrong though, I'm a tea snob too. I have one of those cast iron tea pots, metal tea filters, jars of loose leaf teas that were way too <hovertext>expensive#actually I bet I spend more on coffee now than I did when I was rEAlly into tea</hovertext>. I also got into like, herbal tea and all the things those are supposed to do for you. I still love tea, and I wish I drank it more. Though, I like it more in an afternoon when I can sit with it. That was something I could do more before I had a real job.</p><p>My favorite tea drink is a london fog. Or sometimes a seattle fog, cause I like the version with almond milk. I don't get almond milk as anything but a special treat anymore, mostly because I've been told it's less sustainable than other alt milks. I still like it though.</p><p>Matcha is the next tea drink I'll get into, but I feel like I have too many things already. Lifestyle creep will really getcha if you aren't on top of it.</p><p>OKAY WAIT. Chai might be my favorite tea drink at the moment. Maybe london fog used to be, and I still call it my favorite, but I drink chai way more than I drink a london fog. I make chai at home, I even have a special pot for making it (or hot cocoa or some other hot bev). I grind the spices in a mortar and pestle because it makes me feel witchy and happy. This one takes me longer to make so it's a bit of a special weekend drink.</p>",
      "startshidden": false
    },
    {
      "header": "Hot Chocky",
      "content": "<p>I love to make chocolate beverages. Hot cocoa, hot chocolate, drinking chocolate, I haven't learned the differences between those yet. I have some vague idea but nothing concrete. Anyway, I like to make chocky with those mexican chocolate tabillas. I used to get Abuelitas but there's another one at the grocery store that I have been liking more lately. I like the hot hot chocky, like spicy, I think spicy chocky is a great idea and should get more traction in the US. Feels like something the PNW would get really into. The Seattle Chocolate Company makes a spicy chocolate bar, I know that, so there's gotta be a market for it. But anyway, yeah, I keep a jar of dried hot chilis in my cupboard for when I want to make spicy chocky with mexican chocolate and extra cinnamon.</p><p>Go drink hot drinks to make yourself happy!</p>",
      "startshidden": false
    }
  ]
}