{
	"title": "I don't have a car",
	"date": "20230101, happy new year!",
	"sections": [
		{
			"header": "Why not",
			"content": "<p>My car's moon roof is stuck open and I can't close it. It has been raining fairly hard and I can't get a tarp or a garbage bag to stay on. It's sitting at my dad's house who had an extra garage space while I wait for the appointment with the dealership. They might tell me they need to replace the roof, though I'm confident it can be fixed without replacing it. I'm not confident about my mechanical skills to fix it though, there was a reason I studied eLectrical engineering.</p>",
			"startshidden": false
		},
		{
			"header": "What else",
			"content": "<p>It has an error that comes up intermittently, the error refers to an issue with the catalytic converter. I need to get that looked at. I was also informed recently that I have a headlight, a foglight, and a taillight out. I recently filled the tires with air, they were 10 PSI low except one which lost the cap to the <hovertext>filling post#what is this called? could I yahoo-search it? probably.</hovertext> which was 20 PSI low. Anyway, the TPMS hasn't worked since I got the car. I really should check the tires more often. I have also been told I need to wash my car more.</p><p>I'm hoping I can make it 70,000 more miles, to have a total of 250,000 miles on the car before it dies.</p>",
			"startshidden": false
		},
		{
			"header": "I don't care about my car",
			"content": "<p>I think, looking at the state of the car, I haven't cared for my car. Do I care about my car now? Based on the fact that I am stressed about this, and that I'm writing about it, yeah. But why haven't I taken care of it? I guess it's because I don't like it. Not the car, specifically. It's a nice car. I don't like owning a car. It's a lot of work, it's very expensive. It's stressful to decide when to put gas in the car. I would rather I could walk everywhere, or take the bus. But the buses are uncomfortable and loud and at night, when I want to travel somewhere, I have to walk a while in the dark and have a lot of people look at me. Walking is painful after 10 miles or so, for someone who doesn't practice walking. I'm fit, but not a practiced walker. I also have <hovertext>Raynaud's disease#I'm not officially diagnosed but I don't think it would do anything for me to pay the hundreds of dollars to get a diagnosis</hovertext>, my hands and feet lose all the blood and go entirely numb when I am cold, stressed, and excersizing, like walking outside at night with a bunch of people around.</p><p>Also, why are there so many people outside in Seattle at night? It made me mad to see ten or so (houseless:assumption) people sleeping around a fire outside of an abandoned, and empty, apartment complex. And anyway, why am I scared of them? Am I scared of the people outside at night because of presumptions about their intents? Am I right to be scared? Am I scared because I have, in the past, suffered from social anxieties?</p>",
			"startshidden": false
		},
		{
			"header": "Loneliness",
			"content": "<p>I have friends in Tacoma, and Olympia, and Lynnwood, and Bothell, and Kirkland, and Redmond. I don't know how people make that work without a car. Please tell me. Though I don't mind being alone, I like having time alone. I like to paint and write and read, things that can be fun with people, but I haven't pursued doing those things with people. As I write this, I'm on a Discord call with my friends but they are all playing a game and I'm just chilling. I want to be with people and all be doing the same thing, or like, pursuing the same goal? That makes me happy.</p><p>I used to think I was an introvert. Recently, I've come out as an ambivert. I have a hypothesis that everyone is an ambivert. As the saying goes 'like many things in life, [insert dichotomy here] is a spectrum.'</p><p>Something I would like to accomplish, among the many other things I would like to accomplish, is to be able to better tell when I want to be alone and when I want to be with people, and when I want to be alone with people. I suspect that the latter is true most of the time.</p>",
			"startshidden": false
		}
	]
}






