{
  "title": "That one chapter in Dune where Liet Kynes dies.",
  "date": "20230228",
  "sections": [
    {
      "header": "The surreal feeling.",
      "content": "<p>It's terrible, in the way that terrible is a weird word. As it was pointed out, for me for the first time in a Vsauce video, there is a pattern to the word terrible that explains the weirdness of the word. Horror, horrible, horrific; terror, terrible, terrific. One would expect the connotation of the word to follow through with that pattern, but it just kind of doesn't. The word carries something more profound underneath that links the words to their roots. It is this profound concept, which I am sure there is a better way to describe if I knew better, that I think conveys the way that I feel about that one chapter in Dune.</p>",
      "startshidden": false
    },
    {
      "header": "The chapter.",
      "content": "<p>I know one page number that is in the chapter, at least in my edition of the book. It is 444. I'm sure someone versed in numerology could speak to that, but I can't. I just think a base ten number where all the digits are the same is easy to remember.</p><p>Anyway, this is the chapter where Liet Kynes dies. Spoilers. Kynes, who in the new movie is a person who would use she and her for their pronouns, and in the book is a person who would use he and him, to speak nothing about gender presentation on Arrakis and with influences from Calidan, the setting is probably far straighter than I would give it credit for. For the sake of just picking one, I'll use he/him because I am talking about the book, not the movie. Kynes dies in the desert while severely dehydrated, hallucinating, and still with incredible drive to survive. It is terrible, in the way I described before. It is inspiring to see such perserverence through such trauma. It is awful to see, listen to, read about someone dying in such a profoundly explicit way. Kynes, while knowing fully well what is happening, hallucinates his father lecturing him about basic facts, basic to him and his father that is, about the planet Arrakis. Hawks circle overhead and take interest in his exposed flesh. <hovertext>Note.#When on Arrakis, one wears what is like a wetsuit that keeps most of your skin inside</hovertext></p><p>There is something about this scene that is captivating. Maybe it's just morbid curiosity. From the stance of the story, it's just explaining the dire situation that Muad Dib and Jessica are in. It also puts into reality the fleeting sense of purpose that the story has. It makes me feel that the whole power struggle that everyone is in, for many years before and many years after. Is this Nihilism? I don't know really, I studied engineering instead of philosophy. I think the scene, in it being so graphic, is something that isn't explored much in other media that I have experienced. I don't think it needs to be, and I don't really want to experience it more than what I experienced in this chapter.</p>",
      "startshidden": false
    },
    {
      "header": "Otherwise",
      "content": "<p>On something lighter, I think it's funny that the story is so matter of fact. It reads like a textbook with dialogue, which feels like how I live my life. Please tell me your interpretation of this analogy.</p>",
      "startshidden": false
    }
  ]
}