{
  "title": "Noon is dumb",
  "date": "20230204",
  "sections": [
    {
      "header": "Why is noon",
      "content": "<p>I actually don't mind the concept of noon. Really what I don't like is twelve hour time formats. Noon makes this confusing. Mid day, the hour 12, cannot be AM or PM by definition. AM is antemeridian, PM is post-meridian. Noon, should be 12M. It is the meridian. Why would it be AM or PM?</p><p>My no-research-involved hypothesis is that this is a matter of conceptualizing the time. In my head, the hour 12 is an instant in time, not a span of time. Whereas, if one were to conceptualize the hour as a span of time of length one hour, 12PM meaning post meridian, after the meridian, it is the first hour after the meridian. BUT WAIT then shouldn't it be, 1PM? Or even, 0PM? It's just a dumb system. I'm not going back to edit this to make it better, this is just a stream of consciousness.</p>",
      "startshidden": false
    },
    {
      "header": "How is noon",
      "content": "<p>OK so I googled 12PM to make sure I was even thinking of this correctly. The first result, from www.rmg.co.uk, which I have no idea if this is a reliable source, but it looks ok, says \"typically\" and \"normally\" --- meaning sometimes this isn't even accurate? Someone could say 12PM and mean midnight. This is incredibly confusing to me.</p>",
      "startshidden": false
    },
    {
      "header": "Who is noon",
      "content": "<p>These headings are a joke btw, I don't know who noon is. I'm sure she's great though.</p>",
      "startshidden": false
    },
    {
      "header": "Where is noon",
      "content": "<p>Go watch Computerphile/ Tom Scott talk about time zones.</p>",
      "startshidden": false
    },
    {
      "header": "Whence is noon",
      "content": "<p>Anyway, I never say 12:30 to mean thirty minutes after the twelfth hour of the day started, I have started saying noon thirty. I think I heard someone say this on a TV show, but I can't remember which. I say midnight thirty to refer to the other twelve.</p><p>To make things even worse, I actually use 24 hour time on most of my devices. And if there is a device that has a clock that I can't turn to 24 hour time, I will either not set it, or I will set it to something wayyy off of what it should be just to be annoying. Honestly, time is just weird and I don't like the way it works.</p>",
      "startshidden": false
    },
    {
      "header": "Whither is noon",
      "content": "<p>I think we should convert our time keeping to a clock that resets once every four days, rather than twice a day. This sounds equally as horrible, but I think it would be good for a human brain. I feel like we like things better that come in sets of four, its a small enough number to manage yet it has enough substance that it can be broken up. So no more 12 hour clocks. No more 24 hour clocks. I want 96 hour clocks. Then I think, relative to the standard week, we would have seven week cycles, just another larger scale time frame, like the cycle of the moon, that also doesn't align with a year. Even the four day cycle doesn't align with a year. This is just as ridiculous to me as the 12 hour cycle, but sounds nicer to me. I vote for this.</p>",
      "startshidden": false
    }
  ]
}