{
  "title": "Book report: Legends and Lattes",
  "date": "20230106",
  "sections": [
    {
      "header": "TLDR",
      "content": "<p>Legends and Lattes by Travis Baldree is a cozy time by the fire and makes me want to become a barista. As a coffee girl and an occasional table top roleplaying gamer, it hits my interests like the stick Teddy Roosevelt carried. Maybe that stuff is mainstream, and my hobbies are basic, but I don't care I like it. You'll like it too if you're like me with that. It's easy to read, coming from someone who just started reading real books about half a year ago, and the fantasy coffee makes me daydream about being an orc with a big sword.</p>",
      "startshidden": false
    },
    {
      "header": "Book book book",
      "content": "<p>Viv's our girl. She runs the show, she's got the big sword, she knows how to make coffee. After retiring as an adventurer, she buys a shop, buries some <i>special</i> treasure in the floor, imports BEANS and a MACHINE, hires some people, and runs a shop. That's some of the book. Spoilers ahead.</p>",
      "startshidden": false
    },
    {
      "header": "Spoilers ahead!",
      "content": "<p>I'm assuming you've read the book or don't care, but I'll still keep some things witheld</p>",
      "startshidden": false
    },
    {
      "header": "The machine",
      "content": "<p>I love the way the espresso machine is described. I have one of those lever machines, and I love it, but this steam-powered, bean-grinder-having, shiny beautiful machine makes me jealous. I don't have, nor do I expect I'll ever have the counter space for one, but I still WANT it. This is one of the many items that move the story along. Not so much a plot device, but like, a framing device? I'm no literary fiend, don't get mad. It goes on her journey with the story, and the machine is described differently throughout the book, as her story unfolds.</p>",
      "startshidden": false
    },
    {
      "header": "The rock",
      "content": "<p>The Scalvert Stone is a fun thing. In the end, its just a joke. Like for real, the book is just a setup for this rock to become a punchline. Hillarious, I love this. I envy the type of person who can follow through with the long con like this. I won't say more even though it's the spoiler section, you gotta read it for that.</p><p>The whole thing about the stone is that it brings your heart's desire. At some point, Viv loses the stone. She learns to believe in herself, since she's able to keep going without it. Like, crutches? Life crutches.</p>",
      "startshidden": false
    },
    {
      "header": "The sword",
      "content": "<p>The classic tabletop item. I think this one is like a metaphor for her old life. Actually, I think it's pretty heavy handedly that. Hung up on a wall, yearned for, then broken and calcified, to be moved on from. Yet, still a part of her.</p><p>I like the way that items are used to frame the story. It feels very TTRPG, the way PCs collect items throughout their own journies, and old ones used to represent their pasts. I think it all fits pretty well together.</p><p>Also, I want a cool sword like this.</p>",
      "startshidden": false
    },
    {
      "header": "More about the rock",
      "content": "<p>BACK TO THE ROCK. I feel weird about the way this causes a weird tension that is kind of resolved, but just barely, and it's still a little weird.</p><p>The scalvert stone's major thing is that it brings people that ought to be together, together. Though, whether the magic is more of like gd's tweezers touching a little bit of fate and pushing people who ought to be together together, or whether it is actually like fucking with people's minds to the benefit of the person who does the ritual with the stone is not fully said. And it's kind of freaky! I choose to believe, optimisticly that it's the prior. I don't think this kind of wholesome story would just throw that at you, the reader, who's just trying to have a decent time, and gives you magical gas lighting. Though, it really starts to feel like that at the beginning. I think towards the end, the evidence does point toward the happier version. She loses the stone, and everyone is still there and the relationships that they've built still stand. However, this could just as easily be explained by the stone permanently fUcking with people's minds.</p><p>I'm torn by this, I hate thinking about it, I want this to just be like a nice story but this keeps stopping me. I'm still choosing to believe the happier version but jeeze it's cutting it a little close there.</p>",
      "startshidden": false
    },
    {
      "header": "The romANce",
      "content": "<p>It's cute. I love it. Thandri is the gay devil empath that we need more of in real life. Don't unpack that any more than that. She betters Viv in amazing ways. I do wish we got more of her story, though. While she is a complex character, I still want to read a whole nother book about her. Sequel? Still, if a sequel isn't coming I think a few chapters in her POV would've been a really nice addition to the story, and would've added some depth to her character that we didn't get. She doesn't get much of an arc (mostly since she's already kind of perfect). Her character development is a little bit of opening up to people emotionally, though it kind of seems like she was already 75% there, and maybe ended at 95%. Which is still very cool, but yes definitely wanted more depth.</p>",
      "startshidden": false
    },
    {
      "header": "THIMBLE THE RAT KING",
      "content": "<p>This rat man is the greatest of all of them. He just bake so much. His arc is gaining confidence in himself - also Viv's arc - also that bard's arc. He's perfect and nothing would improve rat man.</p>",
      "startshidden": false
    },
    {
      "header": "That's it",
      "content": "<p>Good book, will read again.</p>",
      "startshidden": false
    }
  ]
}