Book report: Legends and Lattes
2023
20230106
bookreport

TLDR
Legends and Lattes by Travis Baldree is a cozy time by the fire and makes me want to become a barista. As a coffee girl and an occasional table top roleplaying gamer, it hits my interests like the stick Teddy Roosevelt carried. Maybe that stuff is mainstream, and my hobbies are basic, but I don't care I like it. You'll like it too if you're like me with that. It's easy to read, coming from someone who just started reading real books about half a year ago, and the fantasy coffee makes me daydream about being an orc with a big sword.

Book
Viv's our girl. She runs the show, she's got the big sword, she knows how to make coffee. After retiring as an adventurer, she buys a shop, buries some <i>special</i> treasure in the floor, imports BEANS and a MACHINE, hires some people, and runs a shop. That's some of the book. Spoilers ahead.

Spoilers ahead!
I'm assuming you've read the book or don't care, but I'll still keep some things witheld

The machine
I love the way the espresso machine is described. I have one of those lever machines, and I love it, but this steam-powered, bean-grinder-having, shiny beautiful machine makes me jealous. I don't have, nor do I expect I'll ever have the counter space for one, but I still WANT it. This is one of the many items that move the story along. Not so much a plot device, but like, a framing device? I'm no literary fiend, don't get mad. It goes on her journey with the story, and the machine is described differently throughout the book, as her story unfolds.

The rock
The Scalvert Stone is a fun thing. In the end, its just a joke. Like for real, the book is just a setup for this rock to become a punchline. Hillarious, I love this. I envy the type of person who can follow through with the long con like this. I won't say more even though it's the spoiler section, you gotta read it for that.
The whole thing about the stone is that it brings your heart's desire. At some point, Viv loses the stone. She learns to believe in herself, since she's able to keep going without it. Like, crutches? Life crutches. 

The sword
The classic tabletop item. I think this one is like a metaphor for her old life. Actually, I think it's pretty heavy handedly that. Hung up on a wall, yearned for, then broken and calcified, to be moved on from. Yet, still a part of her.
I like the way that items are used to frame the story. It feels very TTRPG, the way PCs collect items throughout their own journies, and old ones used to represent their pasts. I think it all fits pretty well together.

